---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.AnalyticalLinkType
source: html/bbce84ee-2941-f2e9-54d5-8ceab5640867.htm
---
# AnalyticalLinkType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.